#import mathbyarersen as math
#используйте ключевое слово ''as'' для сокращения импорта
#print(math.sqrt(число,либо переменная)
def sqrt(b):
	a = b ** (1/2)
	return a
#///////////////////////////////////////////////
#Пример использования:
#import mathbyarersen as math
#a = math.log(основа,число)
#print(a)
def log(x,y):
  return ln(y)/ln(x)
def ln(x):
  return x/1-x**2/2+x**3/3-x**4/4+x**5/5-x**6/6+x**7/7
#он почти точно считает, считал бы точно,если бы я был не говнопитонистом
#//////////////////////////////////////////////
#округлитель числа
#пример использования:
#math.rtn(параметр,1 округливать до целого числа. 0.1 до одной десятой. либо 0.01)
def rtn(c,f):
	if f = 0.1:
		c
		
	
	
